/**
 * copyright 2022/1/19
 */
package com.leetcode.undo;

import org.junit.Test;
import static com.leetcode.util.LogUtil.info;

/**
    （中等）
    36. 有效的数独
        请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
        数字 1-9 在每一行只能出现一次。
        数字 1-9 在每一列只能出现一次。
        数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
    示例 1：
        输入：board =
                    {{'5','3','.','.','7','.','.','.','.'}
                    ,{'6','.','.','1','9','5','.','.','.'}
                    ,{'.','9','8','.','.','.','.','6','.'}
                    ,{'8','.','.','.','6','.','.','.','3'}
                    ,{'4','.','.','8','.','3','.','.','1'}
                    ,{'7','.','.','.','2','.','.','.','6'}
                    ,{'.','6','.','.','.','.','2','8','.'}
                    ,{'.','.','.','4','1','9','.','.','5'}
                    ,{'.','.','.','.','8','.','.','7','9'}}
        输出：true
    示例 2：
        输入：board =
                    {{'8','3','.','.','7','.','.','.','.'}
                    ,{'6','.','.','1','9','5','.','.','.'}
                    ,{'.','9','8','.','.','.','.','6','.'}
                    ,{'8','.','.','.','6','.','.','.','3'}
                    ,{'4','.','.','8','.','3','.','.','1'}
                    ,{'7','.','.','.','2','.','.','.','6'}
                    ,{'.','6','.','.','.','.','2','8','.'}
                    ,{'.','.','.','4','1','9','.','.','5'}
                    ,{'.','.','.','.','8','.','.','7','9'}}
        输出：false
        解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
*/
public class NO36_N_ValidSudoku {
    
    @Test
    public void test() {
        assert (isValidSudoku(new char[][]{
                     {'5','3','.', '.','7','.', '.','.','.'}
                    ,{'6','.','.', '1','9','5', '.','.','.'}
                    ,{'.','9','8', '.','.','.', '.','6','.'}

                    ,{'8','.','.', '.','6','.', '.','.','3'}
                    ,{'4','.','.', '8','.','3', '.','.','1'}
                    ,{'7','.','.', '.','2','.', '.','.','6'}

                    ,{'.','6','.', '.','.','.', '2','8','.'}
                    ,{'.','.','.', '4','1','9', '.','.','5'}
                    ,{'.','.','.', '.','8','.', '.','7','9'}}));// true

        assert !(isValidSudoku(new char[][]{
                     {'8','3','.', '.','7','.', '.','.','.'}
                    ,{'6','.','.', '1','9','5', '.','.','.'}
                    ,{'.','9','8', '.','.','.', '.','6','.'}

                    ,{'8','.','.', '.','6','.', '.','.','3'}
                    ,{'4','.','.', '8','.','3', '.','.','1'}
                    ,{'7','.','.', '.','2','.', '.','.','6'}

                    ,{'.','6','.', '.','.','.', '2','8','.'}
                    ,{'.','.','.', '4','1','9', '.','.','5'}
                    ,{'.','.','.', '.','8','.', '.','7','9'}}));// false
    }

    public boolean isValidSudoku(char[][] board) {
        return false;
    }

}
















/**
public boolean isValidSudoku(char[][] board) {
    char[] c = new char[9];
    char[][] t = new char[3][9];
    for (int i = 0; i < 9; i++) {
        if (!distinct(board[i]))
            return false;

        for (int f = 0; f < 9; f++) {
            // 填充纵轴
            c[f] = board[f][i];
            // 填充3x3的块
            t[f / 3][(f % 3) + (i % 3) * 3] = board[i][f];
            if ((i + 1) % 3 == 0 && (f + 1) % 3 == 0)
                if (!distinct(t[f / 3]))// 点也就
                    return false;
        }
        // 判断某列是否满足要求
        if (!distinct(c))
            return false;

    }
    return true;
}

public boolean distinct(char[] board) {
    StringBuilder sb = new StringBuilder();
    for (char c : board) {
        if (c != '.') {
            if (sb.indexOf(c+"") != -1)
                return false;
            sb.append(c);
        }
    }
    return true;
}
*/